In [1]:
import pandas as pd
df = pd.read_csv('dataframe.csv')

In [6]:
#Agrupar de acuerdo a la experiencia
list(df.groupby('Experiencia'))

#Agrupar de acuerdo al País
list(df.groupby('Pais'))

#Visualizar mejor los datos
for key,value in list(df.groupby('Experiencia')):
    print(key)
    print(value)

No
  Nombre y Apellido  Edad       Pais Experiencia
0     Lucas Delgado    23     México          No
3        Laura Soto    42  Argentina          No
Si
  Nombre y Apellido  Edad      Pais Experiencia
1    Pedro Ferreyra    18  Honduras          Si
2     Maria Lourdes    18      Perú          Si
4     Mario Vanegas    30    México          Si

In [13]:
#Usar información extra para nuestros datos
df.groupby(["Edad","Nombre y Apellido","Pais"]).agg(["min","max","count"])

#Podemos agregar una columna como referencia
df.groupby(["Edad","Nombre y Apellido","Pais"]).agg({'Experiencia':["min","max","count"]})

                                 Experiencia
                                         min max count
Edad Nombre y Apellido Pais
18   Maria Lourdes     Perú               Si  Si     1
     Pedro Ferreyra    Honduras           Si  Si     1
23   Lucas Delgado     México             No  No     1
30   Mario Vanegas     México             Si  Si     1
42   Laura Soto        Argentina          No  No     1

In [2]:
#ÚLTIMA PARTE

#En base a df agrupamos ciertos paises sin Experiencia en la Variable 'info'
info = df[((df.Pais =='Argentina') | (df.Pais =='México')) & (df.Experiencia =='No')]
info

  Nombre y Apellido  Edad       Pais Experiencia
0     Lucas Delgado    23     México          No
3        Laura Soto    42  Argentina          No

In [4]:
#Juntamos los datos de los dos Países en la variable 'juntar'
juntar = df[(df.Pais =='Argentina') | (df.Pais =='México')]
juntar

  Nombre y Apellido  Edad       Pais Experiencia
0     Lucas Delgado    23     México          No
3        Laura Soto    42  Argentina          No
4     Mario Vanegas    30     México          Si

In [32]:
#Lo siguiente nos indicará que, en base a dichos países, uno sí tiene Experiencia
agrupar = juntar.groupby(['Pais','Experiencia']).size()
agrupar

Experiencia   No   Si
Pais
Argentina    1.0  NaN
México       1.0  1.0

In [ ]:
#Para mejorar aún más la visualización podemos usar unstack
mejorar = agrupar.unstack('Experiencia')
mejorar